#pragma once //  конструкция, применяемая для избежания проблем с «двойным подключением»

// pch.h: это предварительно скомпилированный заголовочный файл.
// Файлы, перечисленные ниже, компилируются только один раз, чтобы улучшить производительность сборки для будущих сборок.
// Это также влияет на производительность IntelliSense, включая автозавершение кода и многие функции просмотра кода.
// Однако перечисленные здесь файлы ВСЕ будут перекомпилированы, если хотя бы один из них будет обновлен между сборками.
// Не добавляйте сюда файлы, которые вы хотите часто обновлять, так как это снизит производительность.

#ifndef PCH_H // Ниже находятся заголовки для предварительной компиляции.
#define PCH_H
// Тут находятся заголовки для предварительной компиляции.

#endif // Конец ввода заголовков для предварительной копиляции.


